{
  "paragraphs": [
    "Daenerys Targaryen enters the House of the Undying, where she experiences many visions. She reaches the audience chamber of the Undying Ones, who give her cryptic information and then try to consume her. Drogon rescues her and she runs outside, where Pyat Pree tries to attack her, but Drogon comes to her help once again. ",
    "Daenerys stands before the House of the Undying. Drogon hisses at the gray and ancient ruin and most of her companions, Ser Jorah, Jhogo, Aggo, and Xaro, tell her she should turn back, but she is resolute to enter the abode of the Warlocks. Pyat Pree steps out to her, saying that Daenerys must enter alone, or not at all. He leads her to the entrance, warning her to always take the door to her right, and only take stairs leading up. On her way she will see visions of the past, future and days that never were, and those that will speak to her from other rooms, but she must not enter any room and keep her path until she reaches the Undying's audience chamber. ",
    "At the entrance, Daenerys drinks a glass of shade of the evening a dwarf gives her, to prepare her for the truths within, and enters. In the House of the Undying, she notices right away that she is in the presence of sorcery. Fortunately, she brought Drogon with her into the Warlocks' home. Daenerys sees a great many visions during her journey through the halls: ",
    "Finally, Daenerys comes upon a room with several figures that are no more than shadows, unbreathing, and over them floats a human heart, blue and corrupted (these are apparently the real Undying). The figures speak inside Dany’s head: ",
    "She now sees visions in her head, floating faster and faster: ",
    "At this point, the visions turn to a nightmare as the Undying try to consume Dany, and she is helpless to stop them until Drogon starts to tear the corrupted heart to pieces. Fleeing from the burning House of the Undying, Pyat Pree attacks her with a dagger, but Drogon interrupts him long enough for Daenerys to hear Jhogo’s whip crack, and then she is in the arms of Ser Jorah. "
  ]
}