{
  "paragraphs": [
    "After aiding in the capture of Harrenhal Arya is now serving Lord Roose Bolton. She is bothered by the killing and head-staking of many of the servants who worked for Lord Tywin, most of them inherited from Lady Shella Whent who held Harrenhal prior to Lord Tywin. Arya does not wish to reveal herself to the Lord of the Dreadfort, even though she knows the man to be one of Robb’s banner-men. ",
    "Arya overhears a meeting between Bolton and his advisors, mainly Freys. The Freys believe that Robb will lose, and that they should sue for peace and leave Harrenhal. Bolton states that he is not a man to be undone, like Stannis Baratheon was. Arya learns that Winterfell has fallen and is horrified when she finds out that her brothers are dead. Bolton dismisses the Freys, and has Arya remove the leeches. ",
    "Qyburn reads a letter from the Lady Walda, Bolton’s new wife. Bolton orders the letter burned, and a message sent to Helman Tallhart, who had recently taken Darry from the Lannisters. Bolton orders him and Robett Glover to burn the castle and put the people within to the sword in the name of King Robb, and then to strike east for Duskendale. Bolton says that both men will wish vengeance for what has transpired to their families and homes in the North. ",
    "Bolton then announces that he will hunt wolves that day, for he cannot sleep with all the howling at night. That evening, Bolton returns with nine dead wolves, and tells Arya that he means to give Harrenhal to Vargo Hoat when he returns to the north. Arya is to remain at Harrenhal to serve the Goat. Outside the tower occupied by the Freys, she hears much shouting within and sees Elmar crying on the steps. The young son of Lord Walder Frey says, \"We’ve been dishonored. There was a bird from the Twins. My lord father says I’ll need to marry someone else.\" Elmar was promised a princess originally, but whether or not he knows it to be Arya is unknown. ",
    "Arya then decides to flee Harrenhal, and eventually convinces Gendry and Hot Pie to come with her that night. They meet at the Tower of Ghosts, Gendry says the postern gate is guarded, and Arya says she will get rid of the guard. She approaches him openly and tells him that Lord Roose has her giving a silver piece to all the guards for their service. She takes out the coin Jaqen gave her and drops it, when the guard reach for it, she slits his throat and the three ride out through a sally port and away from Harrenhal. "
  ]
}
