{
  "paragraphs": [
    "Davos, imprisoned beneath Dragonstone, is visited by Melisandre. The Red Woman tells Davos that her purpose is to keep darkness at bay. When Davos asks about the shadow she birthed, she tells him that Stannis is too weak, and should she draw more life-energy from him he would die. Melisandre tells Davos that there are only two gods, R'hllor and the Great Other, whose name cannot be spoken. They are opposites, white and black, good and evil, fire and ice. The Other is the god of Darkness, the Soul of Ice and his war with R’hllor is everywhere and everlasting. Melisandre claims that the Other’s servants often hide in plain view, but the priests of R’hllor can see through falsehoods. She explains that she saw in the flames that Davos wanted to murder her. Davos admits to this, blaming her for the death of his sons who died in the Battle of the Blackwater. Melisandre speaks of a prophesy, which portends that Azor Ahai will be born again in the light of R’hllor, and she is convinced that Stannis is the embodiment of this prophecy: \"When the red star bleeds and the darkness gathers, Azor Ahai shall be born again amidst smoke and salt to wake dragons out of stone.\" Melisandre departs, telling him that he (Davos) has served R’hllor once and will do so again. ",
    "Later, Axell Florent brings his brother Alester, Stannis’ Hand, and tosses him into the cell with Davos. Lord Florent is a defeated man, and he tells Davos that his nephew Imry died with the fleet, and that most of Stannis’ bannermen were captured at the battle and bent the knee to Joffrey. He is now condemned as a traitor for writing a letter he planned to send to Lord Tywin, offering peace and suggesting that Stannis would swear fealty to Joffrey but would remain Lord of Dragonstone and Storm's End, and that the Florents would get Brightwater Keep back. In addition, he offered Shireen’s hand in marriage to Tommen. Alester rants about Melisandre’s talk of a stone dragon, \"madness, sheer madness. Did we learn nothing from Aerion Brightfire, from the nine mages, from the alchemists? Did we learn nothing from Summerhall? No good has ever come from these dreams of dragons.\" Davos knows Stannis well and tells Florent that Stannis would rather die a king than bend his knee, and that he would never consent to wed his daughter to Tommen, a child born of incest. ",
    null
  ]
}