{
  "paragraphs": [
    "While in his coma, Bran dreams of falling and of a crow teaching him to fly. Then he wakes to find himself crippled and decides to name his direwolf Summer. ",
    "Bran is dreaming of falling; it seems that he has been falling for years. “But I never fall,” he remembers as he falls. As the ground gets closer, Bran believes that he will wake up in the instant before he hits the ground, like he always has before. “And if you don’t?” asks a voice. ",
    "A crow is with him, telling him to fly. Bran insists that he does not know how to fly. The crow asks him if he has ever tried. Bran then asks the crow if he is really a crow and the crow asks Bran if he is really falling. Bran begins to cry, but the crow insists the answer is flying not crying and that flying is easy. When Bran mentions that the crow has wings, the crow says maybe Bran does, too. When Bran searches himself for wings the crow tells him there are different kinds of wings. Bran asks the crow what he is doing and the crow responds that he is teaching Bran to fly. ",
    "When Bran looks down again he can see the whole realm and everything in it. In Winterfell he sees the inhabitants going about their work and sees the heart tree in the godswood looking back at him. Bran sees his mother contemplating a blood-stained knife aboard a ship sailing on the Narrow Sea, and his father pleading with the King near the Trident. He sees Sansa crying herself to sleep and Arya holding her secrets in her heart. ",
    "All around his family Bran sees shadows: One as dark as ash with the terrible face of a hound and another in armour as golden and beautiful as the sun. Over them all looms a giant armoured in stone, but with only darkness and black blood behind its visor. ",
    "In the far east, Bran sees dragons stirring in the fabled Shadow Lands. Bran turns north to the Wall, where he sees Jon sleeping alone and growing cold and hard. Then Bran looks beyond the Wall, and beyond the curtain of light at the edge of the world, into what he calls the \"heart of winter\". What he sees there makes him cry. The crow tells Bran that now he knows why he must live: because winter is coming. ",
    "Bran can see spires of ice rising up to impale him and the bodies of a thousand dreamers before him. The crow tells Bran that he must choose: fly or die. Bran spreads his arms and flies. The crow reacts by pecking at Bran’s face between his eyes, blinding him. ",
    "Suddenly, the crow dissolves into a serving woman with long black hair. Bran realizes he is in Winterfell. The serving woman drops her basin and runs down the steps shouting, “He is awake.” Bran touches the burning space between his eyes where he was pecked but cannot feel a thing. ",
    "Bran’s direwolf jumps up onto his legs, but Bran cannot feel it. When his brother Robb arrives, Bran looks up calmly and says, “His name is Summer.” "
  ]
}