{
  "paragraphs": [
    "Traveling in the rain to the Twins, Catelyn recalls Robb sending Ser Rolph Spicer to deliver Martyn Lannister to the Golden Tooth in an exchange of captives. We also learn that Robett Glover has been put on a ship at Duskendale as part of the agreement. Robb left his wife at Riverrun, and only Ser Raynald Westerling travels with them. Robb has brought 3,500 men with him, those who have been with him since the Battle of the Whispering Wood, and who will follow him to Moat Cailin after the wedding. While passing through the site of the battle, Catelyn thinks of Theon Greyjoy boasting he had almost crossed swords with Ser Jaime and how much ill would have been undone if Theon had died in place of Lord Karstark’s sons. ",
    "When they reach Oldstones, Cat recalls that the ruins were once a great castle of the River Kings during the Mudd Dynasty. The Mudds were First Men, but during the time of King Tristifer IV, the kingdoms of the First Men were falling before the onslaught of the Andals. Tristifer IV died when seven Andal kings joined forces against him. ",
    "Robb tells his mother that he plans to legitimize his brother Jon and name him heir should he and Jeyne not have a child. Catelyn is stunned by this proclamation, and pleads with him not to make the mistake the Targaryens made when King Aegon IV Targaryen legitimized all his bastards on his deathbed. The Blackfyre Pretenders plagued the Targaryens for five generations until Ser Barristan Selmy slew Maelys Blackfyre on the Stepstones. They both fear that Sansa will give the Imp a son and thus control of Winterfell and agree that must be prevented. She pleads that Robb consider naming his sister Arya as heir, but Robb insists that no one has seen Arya since his father's death and that his sister is likely also dead. Catelyn tells Robb that she cannot support his choice of Jon but Robb reminds her that he doesn't have to ask for her support, stating his reason as, \"I'm the King.\" ",
    "Jason Mallister soon joins Robb’s force at Hag's Mire, bringing with him the captain of the Myraham. The man tells them that Balon Greyjoy fell to his death when a wind blew him off one of the bridges between the towers of Pyke, and no sooner was he dead than Euron Crow’s Eye returned and claimed the Seastone Chair, naming himself King of the Iron Islands and the North. Knowing Victarion and Asha will not stand still for this, Robb commands Maege Mormont and Galbart Glover to take men by longship and sail through the marshes of the Neck to seek out Howland Reed. Robb plans to march on Moat Cailin with 12,000 men once he joins with Roose Bolton. The crannogmen will guide a small force under Robb’s command across the swamps in order to reach Moat Cailin from the north. When Galbart warns him what should happen if the crannogmen were to fail him, Robb replies, \"They will not fail. My father knew the worth of Howland Reed.\" Robb then announces that Catelyn will be taken to Seagard under the protection of Lord Jason after the wedding. He then calls his bannermen to fix their seals as witnesses to the decree naming his heir. ",
    null
  ]
}