{
  "paragraphs": [
    "Robb's host approaches The Twins. Robb rides at the head with Catelyn, Edmure beside him and Ser Raynald bearing his banner. Catelyn cautions Robb again about offending Lord Frey, and advises him to ask for food and wine as soon as they arrive to secure the guest rights. They are met by a contingent headed by Ser Ryman Frey, Lord Frey's grandson, and three of Ryman's sons: Edwyn, Black Walder, and Petyr. When they come near, Grey Wind begins to growl and leaps forward, causing Petyr's horse to throw him. Ser Ryman is angered that Queen Jeyne is not among them and Catelyn offers her apologies, but Black Walder says that Lord Walder will be displeased. The Freys tell them they have rooms prepared for Robb, Catelyn, and Edmure, and their bannermen at the Water Tower but the army is to cross the bridge to the far end and join Lord Frey’s and Lord Bolton’s men beneath pavilions erected for the wedding. ",
    "When they reach the gatehouse, Grey Wind refuses to continue and howls. Lame Lothar comes up, saying he must fear the water and offering to give him over to the master of hounds but Robb has Ser Raynald stay with him instead. Robb enters the great hall, where Lord Walder and his eighth wife Joyeuse await. Lord Walder is relentless in his veiled insults against Robb, making it clear that the King betrayed him by breaking his solemn oath. Robb apologizes, and then Roslin is brought out. She is by far the most beautiful of Walder’s get. After Edmure meets his soon-to-be-bride, Catelyn asks the Lord of the Crossing for some food and he says \"bread and salt . . . of course\" and the old man welcomes them as guests to his table. ",
    "When Lord Bolton joins them, Robb finds out more of what happened at Winterfell, and his bannerman tells him that Ramsay rescued many of the women and has been fighting the ironmen. Lord Bolton again states that his bastard son’s blood is tainted, but maybe his deeds will atone for the crimes he committed. He tells them that Ramsay is holding Theon hostage, and he shows them a piece of Greyjoy’s skin, his son having been flaying the captive Greyjoy. Bolton explains that as Balon Greyjoy's sole surviving son, Theon's uncles (Victarion, Euron, and Aeron) will want him dead as his claim to the Seastone Chair is greater than theirs, and that they can demand concessions from the ironborn as the price of Theon's execution; Robb reluctantly agrees for Theon to remain imprisoned at the Dreadfort. Bolton lost men crossing the Trident when Gregor Clegane’s army attacked (see Battle of the Ruby Ford). Bolton has brought mostly his own and Karstark men, leaving all the others to guard the Trident. ",
    null
  ]
}