{
  "paragraphs": [
    "Catelyn listens to the continuous pounding noise of the drums the musicians in the hall are playing. She is seated between Ryman Frey and Roose Bolton during the wedding feast. She remarks to herself how joyless the wedding is, and watches as Robb dances with several of the Frey maids and Edmure dotes on his soon to be wife, Roslin. Catelyn becomes more wary when she learns that Olyvar, Perwyn, and Alesander Frey are all not in attendance at the wedding. She notices Merrett Frey trying to drink the Greatjon under the table, and finally Lord Walder Frey calls for the bedding. Robb does not participate as the Greatjon carries a weeping Roslin to the bed chamber. ",
    "Suddenly, things grow more ominous in the hall as Dacey Mormont goes up to Edwyn Frey and asks him if he wants to dance, but he pushes her away violently. The musicians begin to play a new song, which Catelyn recognises to her horror as \"The Rains of Castamere\" and sees Edwyn leaving. She takes off after him, and when she grabs his arm, she feels the rings of chain mail beneath. Suddenly, it all makes sense to her; the Freys missing from the wedding and Roslin crying. ",
    "The musicians turn out to be crossbowmen, and the wedding becomes a slaughter. Catelyn watches in horror as a crossbow bolt pierces Robb's shoulder and another his leg, and he topples over. Smalljon throws a table over him to save him from three more bolts. Robin Flint is surrounded by Freys, their daggers rising and falling. Ser Wendel Manderly is felled by a quarrel through the mouth. Smalljon bludgeons Ser Raymund Frey across the face with a leg of mutton, but when he reaches for his swordbelt, a crossbow bolt drives him to his knees. Lucas Blackwood is cut down by Ser Hosteen Frey. One of the Vances is hamstrung by Black Walder as he wrestles with Ser Harys Haigh. Crossbows take Donnel Locke, Owen Norrey, and half a dozen more. Young Ser Benfrey Frey seizes Dacey Mormont by the arm, who smashes him in the face with a wine flagon. She runs for the door, but Ser Ryman comes through with Frey men-at-arms and sinks his axe into Dacey's stomach. ",
    "Northmen begin pouring through the other door, and Catelyn takes them for rescue for half a heartbeat, until one of them decapitates Smalljon. Catelyn realizes that she must try to intervene and save her son’s life, she sees a dagger on the floor and crawls toward it, determined to kill Lord Walder. Then Robb stumbles to his feet, an arrow in his chest in addition to the other two. Lord Walder who, in the midst of slaughter, sits on his throne watching greedily, signals a halt to the music and mocks Robb. Catelyn grabs Jinglebell Frey and puts a dagger to the halfwit’s throat. She begs Walder to spare her son, trade a son for a son. But the old man says, \"that's a grandson... and he never was much use.\" ",
    "A man in dark armor and a pale pink cloak spotted with blood steps up to Robb, saying \"Jaime Lannister sends his regards.\" He thrusts his longsword through Robb's heart, and twists. Catelyn keeps her promise and slits the poor halfwit's throat, and then begins to laugh and shout, while someone says, \"she’s lost her wits,\". Someone else says, \"Make an end,\" she is grabbed from behind and feels steel drawn across her own throat. ",
    null,
    null
  ]
}