{
  "paragraphs": [
    "Tyrion Lannister is imprisoned in a tower cell of the Red Keep. His uncle Kevan tells him that Tywin, Mace Tyrell, and Oberyn Martell will stand in judgment of him. When Tyrion claims he may demand trial by combat, his uncle replies that Cersei will name Gregor Clegane as her champion. Tyrion sends for Bronn, but finds the former sellsword to be a changed man, soon to marry Lollys Stokeworth, and now being paid well by the Queen. The mercenary leaves Tyrion to fend for himself, unwilling to stand for the dwarf against the Mountain. ",
    "At the trial, Tyrion declares his innocence, and claims that Sansa was not responsible either. The witnesses that Cersei has brought forth are numerous, and since Tyrion has no witnesses of his own, their word is without refute. Pycelle notes that Tyrion stole poisons from his solar, and Taena Merryweather claims to have seen Tyrion drop something into the King’s wine. ",
    "That night, Kevan tells Tyrion that his only hope is to admit his guilt and he will be permitted to take the black, though Tyrion, remembering what happened to the last man to be made such an offer, is dismissive. They talk about Tyrion's father. Kevan is fiercely loyal to his brother, for it was Tywin who made the Lannisters' enemies pay for their abuse of their father Tytos Lannister, who was a peaceful but weak man. The next morning, Varys nearly seals Tyrion’s fate with damaging evidence against the dwarf. ",
    "Later, Oberyn Martell visits Tyrion, and makes it clear that Cersei has tried to buy his vote in the judgment, mentioning marriage. But the Red Viper has other ideas, and even brings up the point that according to Dornish law, Myrcella is the heir, and that his brother may well crown his ward. Oberyn relates the story Tywin had told him that it was Amory Lorch who killed Elia and her children, but Tyrion tells him the truth--that Lorch only killed Rhaenys, and it was the Mountain who killed Aegon and raped and murdered Elia. The Red Viper speaks of saving Tyrion, not as his judge, but as his champion. ",
    null
  ]
}