{
  "paragraphs": [
    "King Stannis has brought several of the black brothers before him to make known his anger about them taking too long to select a new Lord Commander. Stannis sees through Janos Slynt’s fawning, having known the man as a bribe-taker in King's Landing. The king makes it clear that after they finally vote in a new Lord Commander, he plans to take all the castles along the Wall, except for the three currently occupied by the Watch, to garrison his forces. He also plans to either take or be granted the Gift, stating that he intends to help the Watch guard the Wall. He commands the builders to deliver reports on the conditions of the abandoned castles, and informs the men gathered that nightfires will be lit before the gates of all the castles. When Melisandre mentions the impending war, Maester Aemon is aware that she speaks of the prophesied War for the Dawn. After the others have left, Aemon asks to see the fabled sword Lightbringer through Sam’s eyes. Sam describes the sword as glowing, yet there are no flames. ",
    "Stannis questions Sam about dragonglass, making it known that there are great deposits of obsidian beneath Dragonstone, and that he intends to have it mined and brought to the Wall. The king asks Sam to show him the Black Gate, as he intends to make the Nightfort his seat, and Sam agrees although he is not sure if the gate will open for a man not of the black. When they leave, Maester Aemon asks Sam if he felt any heat emanating from the sword, and he realizes that he did not. Aemon speaks of the choosing, subtly implying that Sam could do something to help speed the process. Determined to put aside the bickering between the two leading candidates, Sam speaks with both Cotter Pyke and Ser Denys Mallister individually. Both are aware they will not be elected and agree that Slynt would be a bad choice. So Sam asks them if they would step aside if the right candidate were to be named. Playing one off the other, using their dislike for each other, Sam sets it up so that each man will lend his support to Jon that night. ",
    null
  ]
}