{
  "paragraphs": [
    "When Brienne reaches Duskendale, she finds the gates barred for the night. The area surrounding it is littered with corpses of both northmen and men from the Reach. ",
    "The gates open at morning, and the captain tells Brienne that his sister can paint over the black bat of Lothston on her shield. After finding and telling the sister what sigil she wants, Brienne heads to the Dun Fort to speak to the lord. Since Lord Rykker is in the field, she meets with the castellan Ser Rufus Leek and a maester, who tells her that many came before her asking if Dontos Hollard and Sansa had come to Duskendale. The Dun Fort's maester tells the story of the Defiance of Duskendale, which seems to have been the incident that finally sent King Aerys over the edge. ",
    "Either of his own initiative, or from the urgings of his wife, Denys Darklyn took Aerys hostage. When Tywin Lannister (who was Hand at the time) surrounded the Dun Fort, Lord Darklyn threatened to kill Aerys. When Aerys was captured, Symon Hollard killed one of his kingsguard, Ser Gwayne Gaunt. ",
    "After Barristan the Bold slipped into the Dun Fort and rescued the king, Aerys had nearly every member of the Darklyn and Hollard families killed or attainted. Dontos, who was young at the time, survived because Barristan asked Aerys to stay his hand. ",
    "The castellan tells Brienne that Duskendale would have been the last place Dontos would have fled to. Despairing that she will never find Sansa, Brienne bumps into a skinny boy whom she also saw back at Rosby on a piebald rounsey, but he runs away. ",
    "Visiting the Seven Swords inn for dinner, Brienne meets a pious dwarf, who tells her that he overheard a man called Nimble Dick in Maidenpool bragging that he had \"fooled a fool\" seeking passage for three across the Narrow Sea. That night, Brienne dreams of Renly's death, but when he topples after the shadow killed him, the body is that of Jaime. ",
    "The next day, Brienne picks up her shield, painted with the sigil that Tanselle had painted for Ser Duncan the Tall. Proceeding to Maidenpool, Brienne camps by the ruins of the Hollard castle, and hears a rider. Fearing it may be Ser Shadrich and that a battle might ensue, she discovers the boy who seems to be stalking her. It turns out to be Podrick Payne, who asks to stay with her, hoping that if she finds Sansa, it may lead the boy back to Tyrion. "
  ]
}
