{
  "paragraphs": [
    "Asha is at Ten Towers waiting for her supporters to arrive. The feast is almost over. There are a lot of Harlaws in the hall but not enough of the other houses. Asha knows she lacks support. ",
    "She tells Three-Tooth to find food for her crew and her prisoners. Then she goes to her uncle Rodrik Harlaw, the lord of Harlaw. She finds him in the Book Tower, reading. Rodrik Harlaw loves his books. It is this love that earned him the nickname \"The Reader\". In Asha's name, Rodrik has sent summons to the captains to gather at Ten Towers. The captains of Harlaw isle have come but very few others. Rodrik informs Asha that Aeron Greyjoy has called for a kingsmoot, an assembly of all captains to choose the king. Rodrik assures Asha that her cause is hopeless, since no woman has ever ruled the ironborn. Even the support of Rodrik does not mean his vassals will support her. Their fealty is for war purposes only. In a kingsmoot they are allowed to vote as they please. Rodrik councils Asha to stay away from the kingsmoot. Besides her lack of support, he is afraid that Euron Greyjoy will kill his competitors. Rodrik offers to give her Ten Towers instead. His heir Harras Harlaw does not need Ten Towers and will protect her. Asha declines the offer and walks back to the hall. ",
    "She encounters Tristifer Botley on the way. When they were young, Tristifer was in love with Asha. Asha liked him in the beginning but became bored with him before he was sent away. Tristifer, though, has never forgotten her and wants to wed Asha. He is the legitimate Lord of House Botley. His father has been killed by Euron Greyjoy for refuting Euron's claim to the throne. His titles have been given to Tristifer's uncle who supported Euron. Asha sharply refuses Tristifer's advances by reminding him that they are not children anymore and that she is his queen, not his wife. ",
    "\r\nEaster egg: In the chapter Rodrik Harlaw mentions an Archmaester named Rigney who believes that history is a wheel. The Wheel of Time fantasy series author Robert Jordan's real name is James Rigney. "
  ]
}