{
  "paragraphs": [
    "At a hidden well at Shandystone in the desert of Dorne, Arianne and her most trusted companions are awaiting the arrival of Myrcella and her sworn sword. Although Arianne has the utmost trust in Garin, Drey and Sylva, she is still unsure about Gerold Dayne the Darkstar. She considers his cruel nature and the mystery surrounding him. She is worried that Arys may be wary of him. But if this would happen and they would to come to blows, who would win? Garin warns Arianne that he does not like the man, but she reminds him that they may need his sword and eventually his castle. Later, Darkstar tells her that this scheme to crown Myrcella will not work as she has planned. He then unsheathes his sword, and reveals that you incite a war with steel (meaning they should kill Myrcella). ",
    "When Arys and Princess Myrcella arrive, Arianne introduces the girl to her companions. Myrcella recalls the great knight Arthur Dayne when she meets Darkstar, which seems to upset the Knight of High Hermitage, because in his mind people always remember his cousin for his famous sword. Arys draws Arianne off alone and reveals that Tywin Lannister is dead. ",
    "They set off at night for the Greenblood, where they will take an orphan's barge west along the river. Myrcella is confused, having been told nothing by Arys, especially the fact that everyone keeps calling her \"your Grace\". Arianne tells her some of their plan, that they intend to crown her Queen, because her brother Tommen was being controlled by evil councillors. During the trip, Myrcella asks Garin why they call him \"an orphan of the Greenblood\" when he has a mother and father. He explains that it is a metaphor for their mourning the loss of their homeland, and the \"mother\" river the Rhoyne. They built barges along the Greenblood and hammered them together, as they did in their ancestral land, for they were never comfortable in the deserts of Dorne. ",
    "As Arianne is considering her plan to crown Myrcella at Hellholt, where Ellaria Sand's father Harmen Uller rules, they reach the river and spot the barge that Garin's people promised would be waiting. But as they get closer, Areo Hotah steps from the cabin with a dozen crossbowmen. Arianne yells for them to flee, while Drey recommends they yield. But Arys Oakheart charges the boat, intent on protecting his two princesses at all costs. Hit with several bolts, he reaches the deck but falls to Captain Hotah's longaxe. As Arianne falls off her horse screaming \"No!\", she hears Myrcella shrieking, and Hotah commanding horsemen to chase after Darkstar, who fled. Arianne notices Myrcella on her hands and knees, her head in her hands and blood streaming down her arms. Then she is brought before Hotah, pleading to know how her father discovered what she planned. The Captain of the Guards responds, \"Someone told. Someone always tells.\" "
  ]
}