{
  "paragraphs": [
    "Victarion Greyjoy's Iron Victory has rammed one of the longships of the Shield Islands. Victarion kills Talbert Serry of Southshield, and the ironborn's massive fleet is soon victorious in their conquest of the Shield Islands which sit at the mouth of the Mander River north of the Port of Oldtown. It is Victarion's command that won the battle, but it will be King Euron they cheer for engineering their bold attack. Back in his cabin, as the dusky woman Euron gave him tends his wounds, Victarion recalls Aeron's words that he would find a way to remove Euron from the Seastone Chair. He remembers how he had helped capture Lord Baelor Blacktyde, who had refused to acknowledge Euron and paid for it with his life. Asha, however, had escaped the Iron Islands along with those loyal to her. ",
    "Landing at Lord Hewett's Town on Oakenshield, the Lord Captain meets the Reader and the Drumm. Both are worried that Euron's little conquest will bring ruin down upon them, as surely Highgarden will respond. At the feast, Victarion notes that Euron has shamed Lord Hewett and his wife and daughters. The recently crowned king then raises Harras Harlaw, Andrik the Unsmiling, Maron Volmark and Nute the Barber to Lords of the four Shield Islands, effectively stealing away the lieutenants of his adversaries. ",
    "Euron declares that they will sail the next day with provisions plundered from the Shield Islands; selling the slaves they had just taken in the Free Cities on their way to find the dragons he had promised. But many of the captains object, stating that they should attack Oldtown or the Arbor, and Euron stalks from the hall. Soon, one of Euron's bastard sons tells the Iron Captain that the king wishes to see him. ",
    "In his room, Euron tells his brother that the Reader was correct that the whole fleet could never reach Slaver's Bay together. But he believes that the Iron Fleet alone could, and promises his brother the Seastone Chair as reward if he sails to Slaver's Bay and returns with Daenerys. Euron means to marry her and ascend to the Iron Throne. With Lord Blacktyde's words that Euron was maddest of them all on his mind, Victarion agrees to go, thinking to himself, "
  ]
}