{
  "paragraphs": [
    "Lord Aurane Waters has returned from Dragonstone with news that the fortress has fallen. This was good news indeed, considering that word from the Reach mentioned the ironmen raiding the Arbor and pushing towards Oldtown. Aurane indicates that Ser Loras was grievously wounded during the assault and lay dying after having had boiling oil poured on him from the walls; he also holds Loras responsible for turning the battle into a massacre, as thousands of the Crown's soldiers died in the storming of Dragonstone's keep, many of them knights or lords. Ecstatic, Cersei had to deliver the news personally to Margaery. The young queen is appalled by Cersei's description of the fate of her brother, and commands Cersei to get out of her quarters. Back in her solar, four separate men bring word on a dwarf sighting, and one brings her a head. However, none of them bear word related to Tyrion, and Cersei sends them away in frustation. Later, in court, Cersei must deal with several unimportant pleas, and then Septon Raynard arrives. Furious that the High Septon himself did not come before her, she scoffs at his words that the Faith is trying to abolish the brothels in the city. ",
    "Pycelle brings word that Lord Gyles may not live much longer, but Cersei demands that the Grand Maester do his utmost to keep the old man alive. At dinner with her son, Tommen mentions that Margaery has been urging him to attend court, to which Cersei responds how much she'd like to see the young queen's tongue torn out. Tommen yells at his mother, but she commands Ser Boros to chastise the boy king's whipping boy. During the night, Cersei dreams of her visit to the witch back when she was 10 years old. She vividly recalls Maggy the Frog's plea that they leave her, but Cersei and Melara will not back down. Maggy commands them to cut open their thumbs, and the old easterner tastes their blood. She prophesized that Cersei would marry the king (not the Prince, as Cersei thought), but her husband would father 16 children and Cersei only three, and that she would reign as queen only \"until there comes another, younger and more beautiful, to cast you down and take all that you hold dear... Gold shall be their crowns and gold their shrouds. And when your tears have drowned you, the valonqar shall wrap his hands about your pale white throat and choke the life from you.\" Maggy also warns that Melara will die very soon, and true enough, she drowns in a well shortly after. ",
    "Waking from the nightmare, she sends for Pycelle to make her a potion that permits sleep without dreams. She asks him if seeing the future is possible, but the old maester evades answering by saying, \"Should our morrows be foretold? And to that I should answer, 'No.' Some doors are best left closed.\" Aggravated, she sends for Qyburn, first asking if Falyse was still capable of being used to root out Bronn. But the necromancer tells her it is too late for that. Then she inquires of him the same she had asked of Pycelle. We learn that Maggy was from the far east, and had married a wealthy merchant. Their son was \"upjumped\" to a petty lord by Cersei's grandfather. Qyburn tells her that the name Maggy was probably a mispronunciation of \"maegi\", and that bloodmagic was very powerful. The de-chained maester suggests that she already knew how to forestall the prophecy. Seizing upon this suggestion, Cersei plans a fool-proof way to have Margaery killed. Deciding that treason would work best, the next day she inquires of Ser Osmund if his brother Osney could defeat Ser Boros in single combat. He replies that it wouldn't even be a match, and wonders if Boros has commited treason. Cersei replies no, but thinks to herself: But Osney has. "
  ]
}