{
  "paragraphs": [
    "Brienne fluctuates between a fever dream and semi-consciousness, as the outlaws transport her severely injured body to Lady Stoneheart. While she is being treated by Jeyne Heddle, Brienne learns that Biter is dead, skewered through the head by a spear wielded by Gendry. Lem, now wearing Sandor's steel dog helm, tells her that Stoneheart wants her hanged for her \"crimes\". Brienne fully awakens in a cave, where she meets Thoros of Myr. The red priest is a ghost of his former self, and he informs her about the current state of the former Brotherhood Without Banners: \"Lord Beric's fire has gone out of this world... A grimmer shadow leads us in his place... War makes monsters of us all.\" ",
    "Before long, Brienne is brought before Lady Stoneheart, where she as well as Pod and Ser Hyle will be judged. Brienne cannot see Stoneheart's face, but notices her holding a bronze crown ringed by iron swords. A northman, most likely Harwin, places Oathkeeper before Stoneheart, along with Brienne's writ signed by King Tommen. The outlaws see this as irrefutable proof that the Maid of Tarth is about Lannister business. Her words are wasted here, as her pleas of innocence fall on deaf ears. Finally, Lady Stoneheart speaks, needing to place her hand over her throat in order to gurgle out her judgment. Upon removing her hood, Brienne is horrified to discover that the Hangwoman is actually Lady Catelyn Stark, albeit now a specter from the grave. Thoros reveals that it was Lord Beric himself who administered the kiss of life to her, finally extinguishing his own unnatural life. ",
    "Stoneheart gives Brienne an ultimatum: kill Ser Jaime Lannister or be hanged. When the Maid states that she will not make that choice, the thing that had been Catelyn Stark orders them hanged. Despite Ser Hyle's pleas for mercy, and Podrick's stoicism, nooses are looped about all three of their necks. As they are hefted upward, thrashing and dying, Brienne screams out a word... "
  ]
}