{
  "paragraphs": [
    "Tyrion has been smuggled out of Pentos inside the litter of Illyrio Mopatis, and they are now on their way to the Rhoyne. Illyrio explains that Tyrion and a sellsword called Griff will meet Daenerys in Volantis, while he remains to \"smooth the way\" for them in Pentos. Illyrio tells Tyrion that Daenerys has need of cunning men such as him, but Tyrion is suspicious: why does Illyrio have a stake in helping Daenerys claim the Iron Throne? Instead of answering, the merchant tells of how when he first met her, Daenerys was young and fearful and her brother Viserys was foolish and greedy, and Mopatis had to post guards on her door to prevent her brother from \"undoing years of planning\" by entering her chambers and raping her before she was given to Khal Drogo. He recounts how the meek little girl he knew was reborn in the Dothraki sea as a true Targaryen, before turning to Slaver's Bay, conquering Astapor, cowing Yunkai and sacking Meereen. He now expects her to make her way to Volantis - where she will meet Tyrion and Griff with enough forces to carry her to Westeros. ",
    "Tyrion presses Illyrio, wanting to know why a slaver city like Volantis and a man such as Illyrio would want to assist Daenerys, and he says that her brother promised him the position of Master of Coin and the castle of his choice. Tyrion also demands to know how he is friends with Varys, and Illyrio tells him that the two of them were thieves together in Pentos - with Varys spying on and stealing from other thieves, then passing them on to Illyrio, who would return the goods to their rightful owners for a fee. Varys trained a network of spies - young boys and girls - to steal information, and eventually the two of them became influential enough that Illyrio was able to marry the daughter of the cousin of the Prince of Pentos, and Varys was sought by Aerys the Mad in his paranoia for the post of Master of Whisperers. ",
    "Over several more days' travel through Andalos, Illyrio tells Tyrion that he has managed to persuade the Golden Company to break their contract with Myr and instead accompany Daenerys. When Tyrion questions how Illyrio convinced the Golden Company- a group that has spent most of its history warring with the Targaryens- to side with Daenerys, the magister reminds Tyrion that the Blackfyre Pretenders are no more and that Daenerys can give the company of exiles what the Blackfyres never could: she can finally take them home. After Tyrion recounts the story of Hugor of the Hill, he tells Illyrio that he had originally intended to become High Septon before he met and married Tysha. Illyrio likewise has a story of a Lysene bed slave, Serra, his second wife, who was killed by the grey plague. As they continue to travel, Tyrion's thoughts turn to Shae, and to Tysha. "
  ]
}
