{
  "paragraphs": [
    "Quentyn Martell, son of the Prince of Dorne, is in Volantis, disguised as a wineseller's servant. He and his servant are attempting to book a passage to Meereen aboard ship, but even in the massive port of Volantis they are unable to find a single ship willing to risk the trip to Slaver's Bay while there is war brewing and the slave trade and fighting pits are both terminated.[1][2] Quentyn is anxious trying to get to Daenerys in Meereen as his father commanded, intent on marrying her. He has heard that she is the most beautiful woman in the world.[3] ",
    "Quentyn is accompanied by Gerris Drinkwater, acting as his merchant master, and Archibald Yronwood. On the trip from Dorne aboard the Meadowlark they were attacked by corsairs from the Disputed Lands, losing their Maester Kedry, Willam Wells and his dear friend Cletus Yronwood. Quentyn feels their loss keenly, and feels in dire need of his missing maester's counsel.[4] ",
    "Quentyn and Gerris meet with the captain of the Adventure, a smuggler's ship, who agrees to take them to Meereen only if they are prepared to pay three times the normal fare - for each of them. Quentyn knows that the man simply plans to take their money and either kill them or enslave them at the first chance he gets.[5] ",
    "The pair debate whether they should give up their quest and return to Dorne, or attempt to travel to Meereen overland via the demon road.[6] Quentyn is anxious not to have any more deaths on his conscience, but he feels his duty to Dorne and to his father is too important to turn back. They travel through the streets to the Merchant's House to meet with Archibald Yronwood. Along the way, they encounter a party of Windblown who are recruiting soldiers as they head to Yunkai to war against Astapor and Meereen. Quentyn tells him that they have no choice but to board Adventure - but Archibald says there is another way to Meereen, less honorable, but faster than the demon road... ",
    null
  ]
}