{
  "paragraphs": [
    "During an inspection of the stores, Jon is informed by Bowen Marsh and some other stewards that there is not enough to feed the Night's Watch, the wildlings, and Stannis' men through the winter. He grimly orders a cut in rations, though he knows it will make him unpopular, and tells Marsh they will find a way to feed everyone. ",
    "He is then summoned to meet with Stannis. Rattleshirt taunts Jon, offering to sing for him and pointing out the red ruby on his iron cuff, and Stannis tells Jon that he is handing the wildling to Jon. Despite his reluctance to be seen as partial to Stannis in the War of Five Kings, he advises him of the ways of the northern lords and offers him advice over how to win them over. He ignores the provocations of the Queen's Men as Stannis tells him that he plans to leave the Wall and take on Ramsay Bolton at the Dreadfort unawares.Arnolf Karstark has been urging Stannis to attack the Dreadfort claiming that it is lightly garrisoned. ",
    "Jon bluntly tells him that his plan will fail, earning more scorn from the Queen's Men. Stannis silences them and orders Jon to explain his reasons. Jon explains several things; firstly, unless Stannis wins Mors Umber (who is offering an alliance in exchange for certain conditions, namely the skull of Mance Rayder and a pardon for his brother Hother Umber, who is fighting under duress for the Boltons) to his cause, Umber will cut Stannis's host to pieces as it crosses his land. Second, the Dreadfort will learn of Stannis's coming long before his arrival and Jon, having seen the castle's defences, knows that a small garrison could hold the Dreadfort against many times their number. Thirdly, with the imminent fall of Moat Cailin to House Bolton, the combined armies of Ramsay and Roose Bolton will outnumber Stannis 5 to 1, and will easily destroy him as he lays siege to the Dreadfort. In addition, the northern lords Stannis seeks to rally to his cause, who have suffered generations of wildings raiding their holdings, will not be pleased to see his wildling conscripts crossing their lands. ",
    "Stannis orders everyone out of the room except Melisandre and Jon. Stannis again offers Winterfell to Jon, but Jon reminds him that Sansa is currently the rightful heir and that he cannot forsake his vows. Stannis says he plans to give Winterfell to Arnolf Karstark, and Jon rebuts that the Karstarks abandoned his brother Robb Stark. Robb had personally beheaded Lord Rickard Karstark after the latter killed two of Stark's prisoners.[1] Jon promises a source of more men to Stannis, if Stannis will let him keep the wildlings to occupy more of the forts at the Wall. Stannis agrees and Jon tells him of the petty lords of the mountains - House Flint, House Wull, House Norrey, and House Liddle. Jon counsels Stannis to march through the mountains, win the mountain clans to his side, then emerge to attack Deepwood Motte and defeat the Ironmen to rouse the north to his side. Stannis agrees that it is a plan likely to succeed and impress the northmen. Jon also warns that the clansmen are deeply devout to the old gods, warning Melisandre that her presence won't be welcome. Melisandre surprises Jon by telling him she will stay at the Wall. He ruefully reflects on how he has acquired a thousand wildlings whom he cannot feed. "
  ]
}