{
  "paragraphs": [
    "A respite at the falling of snow motivates Jon to range beyond the Wall, leading the new recruits of the Night's Watch who follow the old gods to the same grove of weirwoods in the haunted forest where he and Sam swore their vows.[1] Scouting ahead of them go Tom Barleycorn, Big Liddle and Luke of Longtown. ",
    "There are six new recruits - Hareth the Horse from Mole's Town, Arron and Emrick from Fair Isle, Satin from Oldtown and the wildlings Leathers and Jax. ",
    "Of the sixty-three wildlings that Jon invited to join the Watch, Leathers and Jax are the only two to accept so far. Among the others wildlings come to the wall, nineteen are girls and women and were sent to Hardin's Tower to avoid trouble with the men in Castle Black. Their presence makes the men uneasy and there has already been an incident. The spearwives know how to defend themselves and their girls, and three men had to be locked in ice cells. ",
    "Jon means to garrison Deep Lake, Sable Hall and Long Barrow with wildlings under command of offices of the Night's Watch, and to choose an almost completely female contingent for Long Barrow in order to avoid future harassment. Iron Emmett and Dolorous Edd will be Long Barrow's commander and chief steward. ",
    "Other wildlings are also a cause of tension and incidents with the Brothers of the Night's Watch, most noticeably Halleck and his followers. Jon is also worried that the Thenns may blame him for the death of Styr. ",
    "Tom Barleycorn finds a small group of wildlings, including a child and his mother, a Thenn, a Hornfoot and a giant in the weirwood grove. With the advantage of surprise and an effort at diplomacy from Leathers, they succeed in avoiding a fight and even convince the survivors to return to Castle Black with them. ",
    "The recruits swear their vows in the presence of the wildlings. As he hears the verse about guarding the realms of men, Jon realizes that his duties involve protecting the wildlings as well as any other men. ",
    "They return to Castle Black, bringing the two wildling corpses they found with them. Jon consigns the corpses to the ice cells and receives a letter from Stannis, learning that he succeeded at taking Deepwood Motte and received support from various northern clans and houses along the way, including survivors from the battle at Winterfell. His troops now number five thousand and growing. Stannis has also learned that Ramsay Bolton means to marry Arya[2] in Winterfell and promises Jon to save her if he can. He means to have the help of Arnolf Karstark and Mors Umber at his attempt to conquer Winterfell. ",
    "Jon wonders if Arya could have escaped without Stannis's help, as predicted by Melisandre.[3] He also wonders if Roose Bolton could be lying about having Arya in order to bait Stannis and thinks about Mance Rayder and the six spearwives who went with him to rescue Arya.[4] "
  ]
}