{
  "paragraphs": [
    "Balon Swann has arrived in Sunspear, with the skull of Gregor Clegane. He asks that Doran Martell takes his seat in the small council, and that Myrcella Baratheon and Trystane Martell accompany them to King's Landing. His captain of the guard, Areo Hotah, notes that many of the Dornish nobility present, including the bastard daughters of Prince Oberyn Martell do not join in the toast Prince Doran makes to King Tommen I Baratheon. Hotah also notes that Balon would be more of a challenge to defeat than Arys Oakheart was. ",
    "When the feast is done, Prince Doran summons his daughter, Arianne, and the Sand Snakes to his solar and tells them that he has arranged that Myrcella will tell Balon that it was Darkstar who injured her and killed Arys. Once that is done, Obara Sand is to lead Balon to Darkstar's lair at High Hermitage and destroy him. Doran also reveals to the Sand Snakes that sources loyal to him in King's Landing have told him the truth he was not meant to hear of this visit to the capital; Queen Regent Cersei Lannister plots to have Trystane killed on the way. An ambush is planned somewhere in the kingswood, where their party will be attacked by outlaws and Trystane will be slain. Blame for the attack will be placed on the Imp, Tyrion Lannister, as the outlaws will be crying \"Halfman!\" during their attack and Balon will claim to catch a glimpse of the Imp. The Sand Snakes are disbelieving, but Doran points out that knights of the Kingsguard are sworn to obey, regardless of their personal feelings on their orders, and points out that Balon argued against traveling by sea to return to King's Landing, as this would disturb the planned arrangements. Doran still does not want to defy the Iron Throne openly, so Nymeria Sand is to accompany Myrcella back to King's Landing and take the seat on the council, while Tyene Sand is also to travel to King's Landing, ordered to try and get close to the new High Septon and thus give the Martells an ear amongst the Faith. ",
    null
  ]
}
