{
  "paragraphs": [
    "Theon Greyjoy is with some of the spearwives, Rowan as well as Abel. He tells them that it is madness to try to escape as Ramsay Bolton will chase them and hunt them down with his dogs. Abel replies that Stannis must be close by the sounds of the horns and it is unlikely Ramsay would ride out into that. Theon also begs that he not be allowed to fall back into Ramsay's hands alive, to which Squirrel replies \"Abel's word\". ",
    "Hosteen Frey barges into the halls, announcing that Little Walder, son of his brother Merrett, has been killed. Theon looks at the spearwives but Rowan replies that this is no work of theirs. Big Walder implicates the Manderly men, saying that the boy went out to get some silver owed to him. The dispute turns into a spar of words and when Lord Wyman Manderly insults both the dead boy and House Frey simultaneously, Hosteen draws his sword in a blind fury and attacks Manderly, who is sliced under his chins and collapses; his knights leap to defend him and a vicious and bloody fight breaks out. In the end, six White Harbor men lie dead, two Frey men, as well as one of Ramsay's Bastard Boys, Luton. Roose and Ramsay quell the tension by telling the men present if they want blood, they should turn their anger on Stannis. Hosteen replies that once they bring Roose Stannis' head, they will come for Wyman's. ",
    "Roose asks Abel to play them a song and the Freys leave. It is then that Rowan grasps Theon's arm, telling him that the time must be now and that Abel can fend for himself. The plan is to dress the fake Arya up as Squirrel, while the real Squirrel climbs away down the wall. They find the girl in her room, where she is terrified to leave, thinking this is a trap set up by Ramsay. The girl tells the washerwomen that she has been trained, she won't escape, Ramsay does not need to chop off her feet. They finally get her into Squirrel's clothes, and Theon tells her to follow Holly closely, and not to run. ",
    "As they get to the gate they see some guards. Holly seduces one and kills him in the process while Frenya struggles and kills the other- Jeyne lets out a scream in the process, revealing them. Frenya waits at the bottom and fights the rest of the \"kneeler\"s that come to catch them, while Holly and the others get to the top of the wall. Holly then realizes that Frenya has the rope, just before being killed by arrows. ",
    "Theon thinks that if they are caught now they will be brought to Ramsay and tortured. He then throws himself and Jeyne over the battlements. "
  ]
}