{
  "paragraphs": [
    "Cersei is forced to walk from the Great Sept of Baelor to the Red Keep, as atonement for her confessed sins; it is the only way to escape the Sept, as her uncle Kevan will not oppose the Faith and Cersei does not not have enough friends in the Sept to risk a trial like Margaery Tyrell - her only hope is a trial by battle. Cersei feels fear at the thought of being paraded through the streets naked, remembering the violence the smallfolk caused during the riot, but reassures herself that no harm will come to her. ",
    "When morning arrives, her goalers arrive with a group of Silent Sisters, who strip Cersei naked and shave her of every hair on her body. Cersei is then led by an escort of Warrior's Sons (among them, her cousin Lancel, much to Cersei's disgust) to the courtyard, where Cersei finds herself standing close to the spot where Eddard Stark was executed. As the Septas accompanying her announce her sins to the watching crowd, Cersei muses first on how Joffrey undid all her plans and the work of Varys and Littlefinger; had he done as he was told and sent Stark to the Wall, Ned and his knowledge of Cersei's incest would have been removed and the Lannisters would have had peace with Robb Stark, a hostage in the form of Sansa and the freedom to deal with Stannis and Renly Baratheon, but instead Joffrey demanded Stark's head, and after that everything fell apart. Cersei's thoughts then turn to memories of how her father did away with her grandfather's mistress after his death, having her stripped naked and marched through the streets of Lannisport, but Cersei insists to herself she will not be broken and humiliated so easily. ",
    "Cersei is then forced to strip before the crowd and walk to the Red Keep. At first, Cersei walks with dignity, ignoring the insults and worse (such as rotten vegetables and a cat carcass) the crowd throw at her, but as the walk continues and the insults grow worse, mocking her faded beauty and the signs of age on her body, Cersei struggles to maintain her composure. As she walks, Cersei begins to hallucinate, seeing faces of others in the crowd; her father frowning, Ned and Sansa Stark, along with Sansa's wolf staring accusingly at her, Tyrion laughing at her and finally, the face of Maggy the Frog intoning her prophecy: Queen you shall be, until there comes another, younger and more beautiful, to cast you down and take all you hold most dear. ",
    "At this, Cersei breaks down in tears and runs for the Red Keep, collapsing as soon as she staggers into the courtyard. Kevan Lannister orders her covered up and removed, at which point Cersei is picked up by an eight-foot-tall giant of a man, clad in the armour and white cloak of a Kingsguard knight. Qyburn appears and introduces Cersei to his champion, Ser Robert Strong and she is most pleased. "
  ]
}